In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame
import webbrowser
website=website = 'http://en.wikipedia.org/wiki/NFL_win-loss_records'
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
#pip install pandas-datareader
import pandas_datareader
from pandas_datareader import data
import datetime as dt

In [3]:
obj=Series([3,6,9,12])
obj

0     3
1     6
2     9
3    12
dtype: int64

In [4]:
obj.values

array([ 3,  6,  9, 12], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
ww2_cas=Series([8700,4300,30000,21000],index=['USSR','GERMANI','CHINA','USA'])
ww2_cas

USSR        8700
GERMANI     4300
CHINA      30000
USA        21000
dtype: int64

In [7]:
ww2_cas['USA']

21000

In [8]:
#which countries had greater than 4000

In [9]:
ww2_cas[ww2_cas>5000]

USSR      8700
CHINA    30000
USA      21000
dtype: int64

In [10]:
'USSR' in ww2_cas

True

In [11]:
ww2_dict=ww2_cas.to_dict()
ww2_dict

{'USSR': 8700, 'GERMANI': 4300, 'CHINA': 30000, 'USA': 21000}

In [12]:
ww2_cas=Series(ww2_dict)
ww2_cas

USSR        8700
GERMANI     4300
CHINA      30000
USA        21000
dtype: int64

In [13]:
countries=['CHINA','GERMANI','japan','israel','USA','USSR']

In [14]:
obj2=Series(ww2_dict,index=countries)
obj2

CHINA      30000.0
GERMANI     4300.0
japan          NaN
israel         NaN
USA        21000.0
USSR        8700.0
dtype: float64

In [15]:
pd.isnull(obj2)

CHINA      False
GERMANI    False
japan       True
israel      True
USA        False
USSR       False
dtype: bool

In [16]:
pd.notnull(obj2)

CHINA       True
GERMANI     True
japan      False
israel     False
USA         True
USSR        True
dtype: bool

In [17]:
ww2_cas

USSR        8700
GERMANI     4300
CHINA      30000
USA        21000
dtype: int64

In [18]:
obj2

CHINA      30000.0
GERMANI     4300.0
japan          NaN
israel         NaN
USA        21000.0
USSR        8700.0
dtype: float64

In [19]:
ww2_cas+obj2

CHINA      60000.0
GERMANI     8600.0
USA        42000.0
USSR       17400.0
israel         NaN
japan          NaN
dtype: float64

In [20]:
obj2.name='world war cassulties'
obj2

CHINA      30000.0
GERMANI     4300.0
japan          NaN
israel         NaN
USA        21000.0
USSR        8700.0
Name: world war cassulties, dtype: float64

In [21]:
obj2.index.name='countries'
obj2

countries
CHINA      30000.0
GERMANI     4300.0
japan          NaN
israel         NaN
USA        21000.0
USSR        8700.0
Name: world war cassulties, dtype: float64

In [25]:
webbrowser.open(website)
nfl=pd.read_clipboard()
nfl

,Rank,Team,GP,Won,Lost,Tied,Pct.,First,NFL,season,Division
1,Green,Bay,Packers,"1,401",785,581,38.000,0.572,1921,NFC,North
2,Dallas,Cowboys,947,538,403,6,0.571,1960.000,NFC,East,None
3,New,England,Patriots,949,529,411,9.000,0.562,1960,AFC,East
4,Chicago,Bears,"1,436",786,610,42,0.560,1920.000,NFC,North,None
5,Baltimore,Ravens,417,233,183,1,0.560,1996.000,AFC,North,None
6,Miami,Dolphins,865,476,385,4,0.553,1966.000,AFC,East,None

In [26]:
nfl.columns

Index(['Rank', 'Team', 'GP', 'Won', 'Lost', 'Tied', 'Pct.', 'First', 'NFL',
       'season', 'Division'],
      dtype='object')

In [27]:
nfl.Division

1    North
2     None
3     East
4     None
5     None
6     None
Name: Division, dtype: object

In [28]:
nfl['Team']

1         Bay
2     Cowboys
3     England
4       Bears
5      Ravens
6    Dolphins
Name: Team, dtype: object

In [29]:
#יצרתי דאטה פריים עם עמודות ספיציפיות
DataFrame(nfl,columns=['Team','Won','Lost','stadium'])

       Team    Won  Lost  stadium
1       Bay  1,401   785      NaN
2   Cowboys    538   403      NaN
3   England    949   529      NaN
4     Bears    786   610      NaN
5    Ravens    233   183      NaN
6  Dolphins    476   385      NaN

In [30]:
nfl.head(3)

,Rank,Team,GP,Won,Lost,Tied,Pct.,First,NFL,season,Division
1,Green,Bay,Packers,"1,401",785,581,38.000,0.572,1921,NFC,North
2,Dallas,Cowboys,947,538,403,6,0.571,1960.000,NFC,East,None
3,New,England,Patriots,949,529,411,9.000,0.562,1960,AFC,East

In [31]:
nfl.iloc[3]

Rank        Chicago
Team          Bears
GP            1,436
Won             786
Lost            610
Tied             42
Pct.           0.56
First        1920.0
NFL             NFC
season        North
Division       None
Name: 4, dtype: object

In [32]:
nfl['stadium']='barkley satdium'
nfl

,Rank,Team,GP,Won,Lost,Tied,Pct.,First,NFL,season,Division,stadium
1,Green,Bay,Packers,"1,401",785,581,38.000,0.572,1921,NFC,North,barkley satdium
2,Dallas,Cowboys,947,538,403,6,0.571,1960.000,NFC,East,None,barkley satdium
3,New,England,Patriots,949,529,411,9.000,0.562,1960,AFC,East,barkley satdium
4,Chicago,Bears,"1,436",786,610,42,0.560,1920.000,NFC,North,None,barkley satdium
5,Baltimore,Ravens,417,233,183,1,0.560,1996.000,AFC,North,None,barkley satdium
6,Miami,Dolphins,865,476,385,4,0.553,1966.000,AFC,East,None,barkley satdium

In [33]:
nfl['stadium']=np.arange(6)
nfl

,Rank,Team,GP,Won,Lost,Tied,Pct.,First,NFL,season,Division,stadium
1,Green,Bay,Packers,"1,401",785,581,38.000,0.572,1921,NFC,North,0
2,Dallas,Cowboys,947,538,403,6,0.571,1960.000,NFC,East,None,1
3,New,England,Patriots,949,529,411,9.000,0.562,1960,AFC,East,2
4,Chicago,Bears,"1,436",786,610,42,0.560,1920.000,NFC,North,None,3
5,Baltimore,Ravens,417,233,183,1,0.560,1996.000,AFC,North,None,4
6,Miami,Dolphins,865,476,385,4,0.553,1966.000,AFC,East,None,5

In [34]:
stadiums=Series(['barkley satdium','at&t'],index=[4,1])
stadiums

4    barkley satdium
1               at&t
dtype: object

In [35]:
nfl['stadium']=stadiums
nfl

,Rank,Team,GP,Won,Lost,Tied,Pct.,First,NFL,season,Division,stadium
1,Green,Bay,Packers,"1,401",785,581,38.000,0.572,1921,NFC,North,at&t
2,Dallas,Cowboys,947,538,403,6,0.571,1960.000,NFC,East,None,NaN
3,New,England,Patriots,949,529,411,9.000,0.562,1960,AFC,East,NaN
4,Chicago,Bears,"1,436",786,610,42,0.560,1920.000,NFC,North,None,barkley satdium
5,Baltimore,Ravens,417,233,183,1,0.560,1996.000,AFC,North,None,NaN
6,Miami,Dolphins,865,476,385,4,0.553,1966.000,AFC,East,None,NaN

In [36]:
del nfl['stadium']
nfl

,Rank,Team,GP,Won,Lost,Tied,Pct.,First,NFL,season,Division
1,Green,Bay,Packers,"1,401",785,581,38.000,0.572,1921,NFC,North
2,Dallas,Cowboys,947,538,403,6,0.571,1960.000,NFC,East,None
3,New,England,Patriots,949,529,411,9.000,0.562,1960,AFC,East
4,Chicago,Bears,"1,436",786,610,42,0.560,1920.000,NFC,North,None
5,Baltimore,Ravens,417,233,183,1,0.560,1996.000,AFC,North,None
6,Miami,Dolphins,865,476,385,4,0.553,1966.000,AFC,East,None

In [37]:
data={'city':['sf','la','nyc'],'population':[800000,500000,400000]}
data

{'city': ['sf', 'la', 'nyc'], 'population': [800000, 500000, 400000]}

In [38]:
cityframe=DataFrame(data)
cityframe

  city  population
0   sf      800000
1   la      500000
2  nyc      400000

In [39]:
#כל האופציות לדאטה פריים
website = 'http://pandas.pydata.org/pandas-docs/dev/generated/pandas.DataFrame.html'
webbrowser.open(website)

True

In [40]:
myser=Series([1,2,3,4],index=['a','b','c','d'])
myser

a    1
b    2
c    3
d    4
dtype: int64

In [41]:
my_index=myser.index
my_index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [42]:
my_index[3]

'd'

In [43]:
my_index[1:]

Index(['b', 'c', 'd'], dtype='object')

In [44]:
from numpy.random import randn

In [45]:
ser1=Series([1,2,3,4],index=['A','B','C','D'])
ser1

A    1
B    2
C    3
D    4
dtype: int64

In [46]:
ser2=ser1.reindex(['A','B','C','D','E','F'])
ser2

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
dtype: float64

In [47]:
ser2.reindex(['A','B','C','D','E','F','G'],fill_value=9)

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
G    9.0
dtype: float64

In [48]:
ser3=Series(['USA','MEXICO','CANDA'],index=[0,5,10])
ser3

0        USA
5     MEXICO
10     CANDA
dtype: object

In [49]:
ranger=range(15)

In [50]:
#משלים ריקים
ser3.reindex(range(15),method='ffill')

0        USA
1        USA
2        USA
3        USA
4        USA
5     MEXICO
6     MEXICO
7     MEXICO
8     MEXICO
9     MEXICO
10     CANDA
11     CANDA
12     CANDA
13     CANDA
14     CANDA
dtype: object

In [51]:
dframe=DataFrame(randn(25).reshape((5,5)),index=['A','B','D','E','F'],columns=['coll1','coll2','coll3','coll4','coll5'])

In [52]:
dframe

      coll1     coll2     coll3     coll4     coll5
A -1.251649 -0.410302  0.928695 -0.715589 -0.738188
B -0.846635 -0.758246  0.582361 -0.142939 -1.342327
D -0.131031  2.834460  0.012305 -0.869861 -0.672034
E -1.324953 -1.094129 -0.098055 -0.994479  0.526769
F  1.789564 -1.162104 -0.098078  0.489927 -0.478531

In [53]:
dframe2=dframe.reindex(['A','B','C','D','E','F'])
dframe2

      coll1     coll2     coll3     coll4     coll5
A -1.251649 -0.410302  0.928695 -0.715589 -0.738188
B -0.846635 -0.758246  0.582361 -0.142939 -1.342327
C       NaN       NaN       NaN       NaN       NaN
D -0.131031  2.834460  0.012305 -0.869861 -0.672034
E -1.324953 -1.094129 -0.098055 -0.994479  0.526769
F  1.789564 -1.162104 -0.098078  0.489927 -0.478531

In [54]:
new_columns=['coll1','coll2','coll3','coll4','coll5','coll6']

In [55]:
dframe2.reindex(columns=new_columns)

      coll1     coll2     coll3     coll4     coll5  coll6
A -1.251649 -0.410302  0.928695 -0.715589 -0.738188    NaN
B -0.846635 -0.758246  0.582361 -0.142939 -1.342327    NaN
C       NaN       NaN       NaN       NaN       NaN    NaN
D -0.131031  2.834460  0.012305 -0.869861 -0.672034    NaN
E -1.324953 -1.094129 -0.098055 -0.994479  0.526769    NaN
F  1.789564 -1.162104 -0.098078  0.489927 -0.478531    NaN

In [56]:
dframe.iloc[['A','B','C','D','E','F'],new_columns]

IndexError: .iloc requires numeric indexers, got ['A' 'B' 'C' 'D' 'E' 'F']

In [57]:
ser1= Series(np.arange(1,7),index=['coll1','coll2','coll3','coll4','coll5','coll6'])
ser1

coll1    1
coll2    2
coll3    3
coll4    4
coll5    5
coll6    6
dtype: int32

In [59]:
ser1.drop('coll1')

coll2    2
coll3    3
coll4    4
coll5    5
coll6    6
dtype: int32

In [58]:
dframe=DataFrame(np.arange(9).reshape(3,3),index=['sf','la','ny'],columns=['pop','size','year'])
dframe

    pop  size  year
sf    0     1     2
la    3     4     5
ny    6     7     8

In [60]:
dframe.drop('sf')

    pop  size  year
la    3     4     5
ny    6     7     8

In [61]:
dframe.drop('year',axis=1)

    pop  size
sf    0     1
la    3     4
ny    6     7

In [62]:
ser1=Series(np.arange(3),index=['a','b','c'])
ser1**ser1

a    1
b    1
c    4
dtype: int32

In [63]:
ser1['b']

1

In [64]:
ser1[1]

1

In [65]:
ser1[0:3]

a    0
b    1
c    2
dtype: int32

In [66]:
ser1[['a','b']]

a    0
b    1
dtype: int32

In [67]:
ser1[ser1>1]

c    2
dtype: int32

In [68]:
ser1[ser1>1]=10
ser1

a     0
b     1
c    10
dtype: int32

In [69]:
dframe=DataFrame(np.arange(25).reshape(5,5),index=['NYC','LA','SF','DC','Chi'],columns=['A','B','C','D','E'])
dframe

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [70]:
dframe['B']

NYC     1
LA      6
SF     11
DC     16
Chi    21
Name: B, dtype: int32

In [71]:
dframe[['B','E']]

      B   E
NYC   1   4
LA    6   9
SF   11  14
DC   16  19
Chi  21  24

In [72]:
dframe[dframe['C']>8]

      A   B   C   D   E
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [73]:
dframe>10

         A      B      C      D      E
NYC  False  False  False  False  False
LA   False  False  False  False  False
SF   False   True   True   True   True
DC    True   True   True   True   True
Chi   True   True   True   True   True

In [74]:
dframe.iloc[2]

A    10
B    11
C    12
D    13
E    14
Name: SF, dtype: int32

In [75]:
ser1=Series([0,1,2],index=['a','b','c'])
ser1

a    0
b    1
c    2
dtype: int64

In [76]:
ser2=Series([3,4,5,6],index=['a','b','c','d'])
ser2

a    3
b    4
c    5
d    6
dtype: int64

In [77]:
ser2+ser1

a    3.0
b    5.0
c    7.0
d    NaN
dtype: float64

In [78]:
#חוסך זמן כשיוצרים כותרות
dframe=DataFrame(np.arange(25).reshape(5,5),columns=list('ABCDE'),index=['NY','BK','LONDON','MIAMY','JERUSALEM'])

In [79]:
dframe

            A   B   C   D   E
NY          0   1   2   3   4
BK          5   6   7   8   9
LONDON     10  11  12  13  14
MIAMY      15  16  17  18  19
JERUSALEM  20  21  22  23  24

In [80]:
dframe2=DataFrame(np.arange(9).reshape(3,3),columns=list('ADC'),index=['NY','BK','NORMANDI'])
dframe2

          A  D  C
NY        0  1  2
BK        3  4  5
NORMANDI  6  7  8

In [81]:
dframe+dframe2

             A   B     C     D   E
BK         8.0 NaN  12.0  12.0 NaN
JERUSALEM  NaN NaN   NaN   NaN NaN
LONDON     NaN NaN   NaN   NaN NaN
MIAMY      NaN NaN   NaN   NaN NaN
NORMANDI   NaN NaN   NaN   NaN NaN
NY         0.0 NaN   4.0   4.0 NaN

In [82]:
dframe.add(dframe2,fill_value=0)

              A     B     C     D     E
BK          8.0   6.0  12.0  12.0   9.0
JERUSALEM  20.0  21.0  22.0  23.0  24.0
LONDON     10.0  11.0  12.0  13.0  14.0
MIAMY      15.0  16.0  17.0  18.0  19.0
NORMANDI    6.0   NaN   8.0   7.0   NaN
NY          0.0   1.0   4.0   4.0   4.0

In [83]:
ser3=dframe2.iloc[0]
ser3

A    0
D    1
C    2
Name: NY, dtype: int32

In [84]:
ser1=Series(range(3),index=['c','a','b'])
ser1

c    0
a    1
b    2
dtype: int64

In [85]:
ser1.sort_index

<bound method Series.sort_index of c    0
a    1
b    2
dtype: int64>

In [86]:
ser1.order()

AttributeError: 'Series' object has no attribute 'order'

In [87]:
ser2=Series(randn(10))
ser2

0   -0.117555
1    0.958345
2   -0.801730
3    0.264489
4    0.843670
5    0.505710
6   -0.265647
7   -0.677694
8   -1.245466
9    0.433265
dtype: float64

In [88]:
ser2.sort_values()

8   -1.245466
2   -0.801730
7   -0.677694
6   -0.265647
0   -0.117555
3    0.264489
9    0.433265
5    0.505710
4    0.843670
1    0.958345
dtype: float64

In [89]:
arr=np.array([[1,2,np.nan],[np.nan,3,4]])
dframe=DataFrame(arr,index=['A','B'],columns=['one','two','three'])
dframe

   one  two  three
A  1.0  2.0    NaN
B  NaN  3.0    4.0

In [90]:
dframe.sum()

one      1.0
two      5.0
three    4.0
dtype: float64

In [91]:
dframe.sum(axis=1)

A    3.0
B    7.0
dtype: float64

In [92]:
dframe.min()

one      1.0
two      2.0
three    4.0
dtype: float64

In [93]:
 dframe.idxmin()

one      A
two      A
three    B
dtype: object

In [94]:
dframe

   one  two  three
A  1.0  2.0    NaN
B  NaN  3.0    4.0

In [95]:
dframe.cumsum()

   one  two  three
A  1.0  2.0    NaN
B  NaN  5.0    4.0

In [96]:
dframe.describe()

       one       two  three
count  1.0  2.000000    1.0
mean   1.0  2.500000    4.0
std    NaN  0.707107    NaN
min    1.0  2.000000    4.0
25%    1.0  2.250000    4.0
50%    1.0  2.500000    4.0
75%    1.0  2.750000    4.0
max    1.0  3.000000    4.0

In [109]:
all_prices_ = data.get_data_yahoo(['CVX','XOM','BP'],start = dt.datetime(2015,1,1),end = dt.datetime(2018,1,1))
all_prices_

AttributeError: 'dict' object has no attribute 'get_data_yahoo'

In [98]:
all_prices_=all_prices_[['Adj Close','Volume']]
Adj_Close=all_prices_['Adj Close']
Volume=all_prices_['Volume']

NameError: name 'all_prices_' is not defined

In [100]:
Adj_Close

NameError: name 'Adj_Close' is not defined

In [101]:
Volume

NameError: name 'Volume' is not defined

In [102]:
Volume.head

NameError: name 'Volume' is not defined

In [103]:
rets=all_prices_.pct_change
rets

NameError: name 'all_prices_' is not defined

In [104]:
#לא עבד
corr=rets.corr

NameError: name 'rets' is not defined

In [105]:
all_prices_.plot()

NameError: name 'all_prices_' is not defined

In [106]:
sns.heatmap(rets.corr())

NameError: name 'rets' is not defined

In [107]:
ser=Series(['www','ww','www','xzkj',298])
ser.unique()

array(['www', 'ww', 'xzkj', 298], dtype=object)

In [108]:
ser.value_counts()

www     2
ww      1
xzkj    1
298     1
dtype: int64

In [110]:
data=Series(['one','two',np.nan,'four'])

In [113]:
data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [114]:
data.dropna()

0     one
1     two
3    four
dtype: object

In [116]:
dframe=DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,9],[np.nan,np.nan,np.nan]])

In [117]:
dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [120]:
clean=dframe.dropna(how='all')
clean

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [121]:
clean=dframe.dropna(axis=1)
clean

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [122]:
#היררכיה אינדקס:

In [123]:
ser=Series(randn(6),index=[[1,1,1,2,2,2],['a','b','c','a','b','c']])

In [124]:
ser

1  a   -1.062422
   b    1.126036
   c    0.855295
2  a   -1.129381
   b    0.286925
   c    0.174171
dtype: float64

In [126]:
ser.index

MultiIndex([(1, 'a'),
            (1, 'b'),
            (1, 'c'),
            (2, 'a'),
            (2, 'b'),
            (2, 'c')],
           )

In [130]:
dframe=DataFrame(np.arange(16).reshape(4,4),index=[['a','a','b','b'],[1,2,1,2]],columns=[['NY','NY','LA','SF'],['cold','hot','hot','cold']])

In [131]:
dframe

      NY      LA   SF
    cold hot hot cold
a 1    0   1   2    3
  2    4   5   6    7
b 1    8   9  10   11
  2   12  13  14   15